; domain
(define (domain healthcare-delivery)

  (:requirements :strips :typing :numeric-fluents)

  (:types
    robot box content location patient carrier - object
    delivery-robot escort-robot - robot
  )

  (:predicates
    ;; --- Location & Connection ---
    (at ?x - object ?l - location)
    (connected ?from - location ?to - location)
    (not-warehouse ?l - location)

    ;; --- Robot state ---
    (accompanying ?r - escort-robot ?p - patient)
    (has-carrier ?r - delivery-robot ?c - carrier)
    (empty-handed ?r - escort-robot)

    ;; --- Carrier state ---
    (has-box ?c - carrier ?b - box)
    (not-loaded ?c - carrier ?b - box)

    ;; --- Box State ---
    (has-content ?b - box  ?c - content)
    (empty ?b - box)
    
  )

  (:functions
    (carrier-capacity ?c - carrier) ; carrier max capacity
    (carrier-load ?c - carrier) ; carrier current nr of boxes loaded
  )

  ;; --- ACTIONS ---

  ;; Robot Movement
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (at ?r ?to)
      (not (at ?r ?from))
    )
  )

  ;; Loading a box in the carrier
  (:action pickup-box
    :parameters (?r - delivery-robot ?c - carrier ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (not-loaded ?c ?b)
      (has-carrier ?r ?c)
      (< (carrier-load ?c) (carrier-capacity ?c))
    )
    :effect (and
      (has-box ?c ?b)
      (not (at ?b ?l))
      (not (not-loaded ?c ?b))
      (increase (carrier-load ?c) 1)
    )
  )

  (:action drop-box
    :parameters (?r - delivery-robot ?c - carrier ?b - box ?l - location)
    :precondition (and
      (at ?r ?l)
      (has-carrier ?r ?c)
      (has-box ?c ?b)
    )
    :effect (and
      (at ?b ?l)
      (not-loaded ?c ?b)
      (not (has-box ?c ?b))
      (decrease (carrier-load ?c) 1)
    )
  )

  ;; Fill box with content not in the warehouse (limited supply)
  (:action fill-box
    :parameters (?r - delivery-robot ?c - carrier ?b - box ?ct - content ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (at ?ct ?l)
      (empty ?b)
      (not-loaded ?c ?b)
      (not-warehouse ?l)
    )
    :effect (and
      (has-content ?b ?ct)
      (not (empty ?b))
      (not (at ?ct ?l))
    )
  )

  ;; Fill box with content in the warehouse (infinite supply)
  (:action fill-box-warehouse
    :parameters (?r - delivery-robot ?c - carrier ?b - box ?ct - content ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (at ?ct ?l)
      (empty ?b)
      (not-loaded ?c ?b)
    )
    :effect (and
      (has-content ?b ?ct)
      (not (empty ?b))
    )
  )

  ;; Empty box at medical unit
  (:action empty-box
    :parameters (?r - delivery-robot ?c - carrier ?b - box ?ct - content ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?b ?l)
      (has-carrier ?r ?c)
      (has-content ?b ?ct)
    )
    :effect (and
      (at ?ct ?l)
      (empty ?b)
      (not (has-content ?b ?ct))
    )
  )

  ;; Escorting patients
  (:action pickup-patient
    :parameters (?r - escort-robot ?p - patient ?l - location)
    :precondition (and
      (at ?r ?l)
      (at ?p ?l)
      (empty-handed ?r)
    )
    :effect (and
      (accompanying ?r ?p)
      (not (empty-handed ?r))
    )
  )

  (:action drop-patient
    :parameters (?r - escort-robot ?p - patient ?l - location)
    :precondition (and
      (accompanying ?r ?p)
      (at ?r ?l)
    )
    :effect (and
      (at ?p ?l)
      (not (accompanying ?r ?p))
      (empty-handed ?r)
    )
  )
)

; problem
(define (problem healthcare-problem-2)
  (:domain healthcare-delivery)

  ;; OBJECTS
  (:objects
    ;; Locations (unit14 unit 4 at facility 1)
    central-warehouse entrance facility1 facility2 unit11 unit12 unit13 unit14 unit21 unit22 unit23 unit24 - location

    ;; Robots and their carriers
    boxbot1 - delivery-robot
    patientbot1 - escort-robot

    bb1-carrier - carrier

    ;; Contents
    scalpel tongue-depressor aspirin - content

    ;; Boxes
    box1 box2 box3 box4 box5 - box

    ;; Patients
    alice bob - patient
  )

  ;; INITIAL STATE
  (:init
    (not-warehouse entrance)
    (not-warehouse facility1)
    (not-warehouse facility2)
    (not-warehouse unit11)
    (not-warehouse unit12)
    (not-warehouse unit13)
    (not-warehouse unit14)
    (not-warehouse unit21)
    (not-warehouse unit22)
    (not-warehouse unit23)
    (not-warehouse unit24)
    
    ;; Connections
    (connected central-warehouse entrance)
    (connected entrance central-warehouse)
    (connected entrance facility1)
    (connected facility1 entrance)

    (connected facility1 unit11)
    (connected facility1 unit12)
    (connected facility1 unit13)
    (connected facility1 unit14)
    (connected unit11 facility1)
    (connected unit12 facility1)
    (connected unit13 facility1)
    (connected unit14 facility1)

    (connected facility2 unit21)
    (connected facility2 unit22)
    (connected facility2 unit23)
    (connected facility2 unit24)
    (connected unit21 facility2)
    (connected unit22 facility2)
    (connected unit23 facility2)
    (connected unit24 facility2)

    (connected facility1 facility2)
    (connected facility2 facility1)

    ;; Robots initial state
    (at boxbot1 central-warehouse)
    (at patientbot1 entrance)
    (has-carrier boxbot1 bb1-carrier)
    (empty-handed patientbot1)

    ;; Carriers
    ;(at bb1-carrier central-warehouse)
    (not-loaded bb1-carrier box1)
    (not-loaded bb1-carrier box2)
    (not-loaded bb1-carrier box3)
    (not-loaded bb1-carrier box4)
    (not-loaded bb1-carrier box5)

    ;; Boxes
    (at box1 central-warehouse)
    (at box2 central-warehouse)
    (at box3 central-warehouse)
    (at box4 central-warehouse)
    (at box5 central-warehouse)
    (empty box1)
    (empty box2)
    (empty box3)
    (empty box4)
    (empty box5)

    ;; Contents
    (at scalpel central-warehouse)
    (at aspirin central-warehouse)
    (at tongue-depressor central-warehouse)
    
    ;; Patients
    (at alice entrance)
    (at bob entrance)

    (= (carrier-capacity bb1-carrier) 3)
    (= (carrier-load bb1-carrier) 0)
  )

  ;; GOALS
  (:goal (and
    (at scalpel unit11)
    (at aspirin unit21)
    (at tongue-depressor unit21)
    (at tongue-depressor unit24)
    (at alice unit14)
    (at bob unit24)
  ))
)

; plan
1. (pickup-patient patientbot1 alice entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 alice)
   goals met: 0 of 6
2. (fill-box-warehouse boxbot1 bb1-carrier box1 tongue-depressor central-warehouse)
   deleted: (empty box1)
   added: (has-content box1 tongue-depressor)
   goals met: 0 of 6
3. (fill-box-warehouse boxbot1 bb1-carrier box2 scalpel central-warehouse)
   deleted: (empty box2)
   added: (has-content box2 scalpel)
   goals met: 0 of 6
4. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 0 of 6
5. (pickup-box boxbot1 bb1-carrier box1 central-warehouse)
   deleted: (at box1 central-warehouse) (not-loaded bb1-carrier box1)
   added: (has-box bb1-carrier box1)
   changed: (carrier-load bb1-carrier) from 0 to 1
   goals met: 0 of 6
6. (move patientbot1 facility1 unit14)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 unit14)
   goals met: 0 of 6
7. (pickup-box boxbot1 bb1-carrier box2 central-warehouse)
   deleted: (at box2 central-warehouse) (not-loaded bb1-carrier box2)
   added: (has-box bb1-carrier box2)
   changed: (carrier-load bb1-carrier) from 1 to 2
   goals met: 0 of 6
8. (drop-patient patientbot1 alice unit14)
   deleted: (accompanying patientbot1 alice)
   added: (at alice unit14) (empty-handed patientbot1)
   goals met: 1 of 6
9. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 1 of 6
10. (move patientbot1 unit14 facility1)
   deleted: (at patientbot1 unit14)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
11. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 1 of 6
12. (move patientbot1 facility1 entrance)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 entrance)
   goals met: 1 of 6
13. (move boxbot1 facility1 unit11)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 unit11)
   goals met: 1 of 6
14. (pickup-patient patientbot1 bob entrance)
   deleted: (empty-handed patientbot1)
   added: (accompanying patientbot1 bob)
   goals met: 1 of 6
15. (drop-box boxbot1 bb1-carrier box2 unit11)
   deleted: (has-box bb1-carrier box2)
   added: (at box2 unit11) (not-loaded bb1-carrier box2)
   changed: (carrier-load bb1-carrier) from 2 to 1
   goals met: 1 of 6
16. (move patientbot1 entrance facility1)
   deleted: (at patientbot1 entrance)
   added: (at patientbot1 facility1)
   goals met: 1 of 6
17. (empty-box boxbot1 bb1-carrier box2 scalpel unit11)
   deleted: (has-content box2 scalpel)
   added: (at scalpel unit11) (empty box2)
   goals met: 2 of 6
18. (move patientbot1 facility1 facility2)
   deleted: (at patientbot1 facility1)
   added: (at patientbot1 facility2)
   goals met: 2 of 6
19. (move boxbot1 unit11 facility1)
   deleted: (at boxbot1 unit11)
   added: (at boxbot1 facility1)
   goals met: 2 of 6
20. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 2 of 6
21. (move patientbot1 facility2 unit24)
   deleted: (at patientbot1 facility2)
   added: (at patientbot1 unit24)
   goals met: 2 of 6
22. (drop-patient patientbot1 bob unit24)
   deleted: (accompanying patientbot1 bob)
   added: (at bob unit24) (empty-handed patientbot1)
   goals met: 3 of 6
23. (move boxbot1 facility2 unit24)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit24)
   goals met: 3 of 6
24. (drop-box boxbot1 bb1-carrier box1 unit24)
   deleted: (has-box bb1-carrier box1)
   added: (at box1 unit24) (not-loaded bb1-carrier box1)
   changed: (carrier-load bb1-carrier) from 1 to 0
   goals met: 3 of 6
25. (move boxbot1 unit24 facility2)
   deleted: (at boxbot1 unit24)
   added: (at boxbot1 facility2)
   goals met: 3 of 6
26. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 3 of 6
27. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 3 of 6
28. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 3 of 6
29. (fill-box-warehouse boxbot1 bb1-carrier box3 tongue-depressor central-warehouse)
   deleted: (empty box3)
   added: (has-content box3 tongue-depressor)
   goals met: 3 of 6
30. (fill-box-warehouse boxbot1 bb1-carrier box4 aspirin central-warehouse)
   deleted: (empty box4)
   added: (has-content box4 aspirin)
   goals met: 3 of 6
31. (pickup-box boxbot1 bb1-carrier box3 central-warehouse)
   deleted: (at box3 central-warehouse) (not-loaded bb1-carrier box3)
   added: (has-box bb1-carrier box3)
   changed: (carrier-load bb1-carrier) from 0 to 1
   goals met: 3 of 6
32. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 3 of 6
33. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 3 of 6
34. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 3 of 6
35. (move boxbot1 facility2 unit21)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit21)
   goals met: 3 of 6
36. (drop-box boxbot1 bb1-carrier box3 unit21)
   deleted: (has-box bb1-carrier box3)
   added: (at box3 unit21) (not-loaded bb1-carrier box3)
   changed: (carrier-load bb1-carrier) from 1 to 0
   goals met: 3 of 6
37. (empty-box boxbot1 bb1-carrier box3 tongue-depressor unit21)
   deleted: (has-content box3 tongue-depressor)
   added: (at tongue-depressor unit21) (empty box3)
   goals met: 4 of 6
38. (move boxbot1 unit21 facility2)
   deleted: (at boxbot1 unit21)
   added: (at boxbot1 facility2)
   goals met: 4 of 6
39. (move boxbot1 facility2 unit24)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit24)
   goals met: 4 of 6
40. (empty-box boxbot1 bb1-carrier box1 tongue-depressor unit24)
   deleted: (has-content box1 tongue-depressor)
   added: (at tongue-depressor unit24) (empty box1)
   goals met: 5 of 6
41. (move boxbot1 unit24 facility2)
   deleted: (at boxbot1 unit24)
   added: (at boxbot1 facility2)
   goals met: 5 of 6
42. (move boxbot1 facility2 facility1)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
43. (move boxbot1 facility1 entrance)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
44. (move boxbot1 entrance central-warehouse)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 central-warehouse)
   goals met: 5 of 6
45. (pickup-box boxbot1 bb1-carrier box4 central-warehouse)
   deleted: (at box4 central-warehouse) (not-loaded bb1-carrier box4)
   added: (has-box bb1-carrier box4)
   changed: (carrier-load bb1-carrier) from 0 to 1
   goals met: 5 of 6
46. (move boxbot1 central-warehouse entrance)
   deleted: (at boxbot1 central-warehouse)
   added: (at boxbot1 entrance)
   goals met: 5 of 6
47. (move boxbot1 entrance facility1)
   deleted: (at boxbot1 entrance)
   added: (at boxbot1 facility1)
   goals met: 5 of 6
48. (move boxbot1 facility1 facility2)
   deleted: (at boxbot1 facility1)
   added: (at boxbot1 facility2)
   goals met: 5 of 6
49. (move boxbot1 facility2 unit21)
   deleted: (at boxbot1 facility2)
   added: (at boxbot1 unit21)
   goals met: 5 of 6
50. (drop-box boxbot1 bb1-carrier box4 unit21)
   deleted: (has-box bb1-carrier box4)
   added: (at box4 unit21) (not-loaded bb1-carrier box4)
   changed: (carrier-load bb1-carrier) from 1 to 0
   goals met: 5 of 6
51. (empty-box boxbot1 bb1-carrier box4 aspirin unit21)
   deleted: (has-content box4 aspirin)
   added: (at aspirin unit21) (empty box4)
   goals met: 6 of 6
